---
type: AnalyticalLinkType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 8
tags: [revit-api, class]
---

# AnalyticalLinkType

`Autodesk.Revit.DB.Structure.AnalyticalLinkType` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidAnalyticalFixityState | 2013 | `public static bool IsValidAnalyticalFixityState ( AnalyticalFixityState fixityState )` |
| Property | Parameter | — | `` |
| Property | RotationX | 2013 | `public AnalyticalFixityState RotationX { get ; set ; }` |
| Property | RotationY | 2013 | `public AnalyticalFixityState RotationY { get ; set ; }` |
| Property | RotationZ | 2013 | `public AnalyticalFixityState RotationZ { get ; set ; }` |
| Property | TranslationX | 2013 | `public AnalyticalFixityState TranslationX { get ; set ; }` |
| Property | TranslationY | 2013 | `public AnalyticalFixityState TranslationY { get ; set ; }` |
| Property | TranslationZ | 2013 | `public AnalyticalFixityState TranslationZ { get ; set ; }` |